3B/CS486/04-Informed-Heuristic-Search.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-10-18 Fri 00:37 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Informed/Heuristic Search</title>
<meta name="author" content="Arnav Gupta" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="src/latex.css" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Informed/Heuristic Search</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org5dc1df8">1. Heuristic Search</a>
<ul>
<li><a href="#org59359f8">1.1. Greedy Best-First Search</a>
<ul>
<li><a href="#orgd134de2">1.1.1. Properties of GBFS</a></li>
</ul>
</li>
<li><a href="#org344ac85">1.2. Heuristic Depth-First Search</a></li>
</ul>
</li>
<li><a href="#orga1ba695">2. A* Search</a>
<ul>
<li><a href="#org58150c9">2.1. Admissibility of A*</a>
<ul>
<li><a href="#org5c7157b">2.1.1. Dominating Heuristic</a></li>
</ul>
</li>
<li><a href="#org832fb5d">2.2. Properties of A* Search</a></li>
<li><a href="#org9053c75">2.3. Multi-Path Pruning and A*</a></li>
</ul>
</li>
<li><a href="#org4294200">3. Adversarial Search</a>
<ul>
<li><a href="#org0f56682">3.1. Bidirectional Search</a></li>
<li><a href="#org2fc0e5e">3.2. Island Driven Search</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org5dc1df8" class="outline-2">
<h2 id="org5dc1df8"><span class="section-number-2">1.</span> Heuristic Search</h2>
<div class="outline-text-2" id="text-1">
<p>
Use <b>heuristics</b> to guide the search towards the goals.
\(h(n)\) is an estimate of the cost of the shortest path from node \(n\) to a goal node.
Computing the heuristic must be much easier than solving the problem.
</p>

<p>
\(h(n)\) is an <b>underestimate</b> if there is no path from \(n\) to a goal that has path length
less than \(h(n)\).
</p>
</div>
<div id="outline-container-org59359f8" class="outline-3">
<h3 id="org59359f8"><span class="section-number-3">1.1.</span> Greedy Best-First Search</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Select the path whose end is closest to a goal according to the heuristic function, that is minimal
\(h\) value.
Treat the frontier as a priority queue ordered by \(h\).
</p>
</div>
<div id="outline-container-orgd134de2" class="outline-4">
<h4 id="orgd134de2"><span class="section-number-4">1.1.1.</span> Properties of GBFS</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
Properties:
</p>
<ul class="org-ul">
<li><i>space complexity</i>: exponential</li>
<li><i>time complexity</i>: exponential</li>
<li><i>completeness</i>: no, could be stuck in a cycle</li>
<li><i>optimality</i>: no, may return sub-optimal path first</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org344ac85" class="outline-3">
<h3 id="org344ac85"><span class="section-number-3">1.2.</span> Heuristic Depth-First Search</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Do a DFS but add paths to the stack ordered by \(h\).
</p>

<p>
Same properties as DFS.
</p>
</div>
</div>
</div>
