3B/CS486/04-Informed-Heuristic-Search.tex
% Created 2024-10-18 Fri 00:37
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{parskip,darkmode}
\enabledarkmode
\usepackage{tikz}
\usetikzlibrary{positioning, calc}
\usepackage{algorithm,algpseudocode}
\author{Arnav Gupta}
\date{\today}
\title{Informed/Heuristic Search}
\hypersetup{
 pdfauthor={Arnav Gupta},
 pdftitle={Informed/Heuristic Search},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.4 (Org mode 9.7.11)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Heuristic Search}
\label{sec:org7aa712d}
Use \textbf{heuristics} to guide the search towards the goals.
\(h(n)\) is an estimate of the cost of the shortest path from node \(n\) to a goal node.
Computing the heuristic must be much easier than solving the problem.

\(h(n)\) is an \textbf{underestimate} if there is no path from \(n\) to a goal that has path length
less than \(h(n)\).
\subsection{Greedy Best-First Search}
\label{sec:org9f531f3}
Select the path whose end is closest to a goal according to the heuristic function, that is minimal
\(h\) value.
Treat the frontier as a priority queue ordered by \(h\).

\begin{center}
    \begin{tikzpicture}[node distance=1.5cm, every node/.style={circle, draw, fill=blue!80!black!60}]
        \node (A) {A; h=6}; % Node A with heuristic 6
        \node (B) [right=of A] {B; h=5}; % Node B with heuristic 5
        \node (C) [right=of B] {C; h=2}; % Node C with heuristic 2
        \node (D) [below=of B] {D; h=3}; % Node D with heuristic 3
        \node (E) [below=of C] {E; h=1}; % Node E with heuristic 1
        \node (F) [below=of D, fill=black!80] {F; h=0}; % Goal node F highlighted with heuristic 0
        \node (G) [below=of E] {G; h=2}; % Node G with heuristic 2

        \draw (A) -- (B);
        \draw (A) -- (D);
        \draw (B) -- (C);
        \draw (B) -- (D);
        \draw (C) -- (E);
        \draw (D) -- (F);
        \draw (E) -- (G);

        % Cost labels with better visibility
        \node[draw, rectangle, fill=yellow!80, text=black, inner sep=1pt] at ($(A)!0.5!(B)$) [above] {1};
        \node[draw, rectangle, fill=yellow!80, text=black, inner sep=1pt] at ($(A)!0.5!(D)$) [left] {4};
        \node[draw, rectangle, fill=yellow!80, text=black, inner sep=1pt] at ($(B)!0.5!(C)$) [above] {2};
        \node[draw, rectangle, fill=yellow!80, text=black, inner sep=1pt] at ($(B)!0.5!(D)$) [right] {3};
        \node[draw, rectangle, fill=yellow!80, text=black, inner sep=1pt] at ($(C)!0.5!(E)$) [right] {1};
        \node[draw, rectangle, fill=yellow!80, text=black, inner sep=1pt] at ($(D)!0.5!(F)$) [left] {2};
        \node[draw, rectangle, fill=yellow!80, text=black, inner sep=1pt] at ($(E)!0.5!(G)$) [right] {1};

        % Highlight the explored edges
        \foreach \i/\j in {A/B, A/D, B/C, C/E, D/F, E/G} {
            \draw[thick, red] (\i) -- (\j);
        }

        % Indicate traversal order with black circles
        \node[draw, circle, fill=black!70, inner sep=1pt] at (A) [above right=0.2cm and 0.2cm of A] {\textcolor{white}{1}};
        \node[draw, circle, fill=black!70, inner sep=1pt] at (B) [above right=0.2cm and 0.2cm of B] {\textcolor{white}{2}};
        \node[draw, circle, fill=black!70, inner sep=1pt] at (D) [below left=0.2cm and 0.2cm of D] {\textcolor{white}{6}};
        \node[draw, circle, fill=black!70, inner sep=1pt] at (C) [above right=0.2cm and 0.2cm of C] {\textcolor{white}{3}};
        \node[draw, circle, fill=black!70, inner sep=1pt] at (F) [below left=0.2cm and 0.2cm of F] {\textcolor{white}{7}};
        \node[draw, circle, fill=black!70, inner sep=1pt] at (E) [below right=0.2cm and 0.2cm of E] {\textcolor{white}{4}};
        \node[draw, circle, fill=black!70, inner sep=1pt] at (G) [below right=0.2cm and 0.2cm of G] {\textcolor{white}{5}};
\end{tikzpicture}
\end{center}
\subsubsection{Properties of GBFS}
\label{sec:orgc5c6689}
Properties:
\begin{itemize}
\item \emph{space complexity}: exponential
\item \emph{time complexity}: exponential
\item \emph{completeness}: no, could be stuck in a cycle
\item \emph{optimality}: no, may return sub-optimal path first
\end{itemize}
\subsection{Heuristic Depth-First Search}
\label{sec:org8c8c8e4}
Do a DFS but add paths to the stack ordered by \(h\).

Same properties as DFS.
