3B/CS486/04-Informed-Heuristic-Search.html
<div id="outline-container-orga1ba695" class="outline-2">
<h2 id="orga1ba695"><span class="section-number-2">2.</span> A* Search</h2>
<div class="outline-text-2" id="text-2">
<p>
Use both path cost and heuristics.
The sum of the path cost and heuristic from the end of the path to the goal is the <b>total path cost</b>.
</p>

<p>
Treats the frontier as a priority queue ordered by this sum.
Always selects the node on the frontier with the lowest estimated distance from the start to a goal node
constrained to go via that node.
</p>
</div>
<div id="outline-container-org58150c9" class="outline-3">
<h3 id="org58150c9"><span class="section-number-3">2.1.</span> Admissibility of A*</h3>
<div class="outline-text-3" id="text-2-1">
<p>
A* always finds an optimal solution as the first path to the goal, if:
</p>
<ul class="org-ul">
<li>the branching factor is finite</li>
<li>arc costs are bounded above 0</li>
<li>\(h(n)\) is a lower bound on the cost of the shortest path from \(n\) to a goal node</li>
</ul>

<p>
<b>Admissible</b> heuristics never overestimate the cost to the goal.
</p>

<p>
A* halts since the cost of the paths on the frontier keeps increasing and will eventually exceed
any finite number.
</p>

<p>
To construct an admissible heuristic:
</p>
<ol class="org-ol">
<li>define a relaxed problem by simplifying or removing constraints on the original problem</li>
<li>solve the relaxed problem without search</li>
<li>the cost of the optimal solution to the relaxed problem is an admissible heuristic for the the
original problem</li>
</ol>

<p>
Preferred heuristics have higher values and are very different for different states (should help in
choosing which path to take).
</p>
</div>
<div id="outline-container-org5c7157b" class="outline-4">
<h4 id="org5c7157b"><span class="section-number-4">2.1.1.</span> Dominating Heuristic</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
Given heuristics \(h_{1}(n)\) and \(h_{2}(n)\), \(h_{2}(n)\) dominates \(h_{1}(n)\) if:
</p>
<ul class="org-ul">
<li>\(\forall n \; h_{2}(n) \ge h_{1} (n)\)</li>
<li>\(\exists n \; h_{2}(n) > h_{1} (n)\)</li>
</ul>

<p>
If \(h_{2}(n)\) dominates \(h_{1}(n)\), A* using \(h_{2}\) will never expand more nodes than A* using
\(h_{1}(n)\).
</p>
</div>
</div>
</div>
<div id="outline-container-org832fb5d" class="outline-3">
<h3 id="org832fb5d"><span class="section-number-3">2.2.</span> Properties of A* Search</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Properties:
</p>
<ul class="org-ul">
<li><i>space complexity</i>: exponential</li>
<li><i>time complexity</i>: exponential</li>
<li><i>completeness</i>: yes, with above assumptions</li>
<li><i>optimality</i>: yes, with above assumptions</li>
</ul>

<p>
A* is optimally efficient: no other algorithm with the same start node and same heuristic can find the
optimal path to the goal and expand fewer nodes.
This is because any algorithm that does not expand all nodes \(f(n) < \text{cost}(s,g)\) run the risk
of missing the optimal solution.
</p>
</div>
</div>
<div id="outline-container-org9053c75" class="outline-3">
<h3 id="org9053c75"><span class="section-number-3">2.3.</span> Multi-Path Pruning and A*</h3>
<div class="outline-text-3" id="text-2-3">
<p>
With A*, it is possible that a subsequent path to some node is shorter than the first path to it.
To avoid this, ensure the heuristic is monotone.
</p>

<p>
A heuristic \(h\) is <b>monotone</b> is \(h(m) - h(n) \le \text{cost} (m, n)\) for every arc
\(\left< m, n \right>\).
This ensures the heuristic estimate of the path cost between any two adjacent nodes
is always less than the actual cost.
</p>

<p>
If \(h\) satisfies the monotone restriction, A* with multi-path pruning always finds the shortest path
to a goal.
</p>
</div>
</div>
</div>
