3B/CS486/04-Informed-Heuristic-Search.tex
\section{A* Search}
\label{sec:orgdb09d56}
Use both path cost and heuristics.
The sum of the path cost and heuristic from the end of the path to the goal is the \textbf{total path cost}.

Treats the frontier as a priority queue ordered by this sum.
Always selects the node on the frontier with the lowest estimated distance from the start to a goal node
constrained to go via that node.

\begin{center}
\begin{tikzpicture}[node distance=1.5cm, every node/.style={circle, draw, fill=blue!80!black!60}]
        \node (A) {A; h=6}; % Node A with heuristic 6
        \node (B) [right=of A] {B; h=4}; % Node B with heuristic 4
        \node (C) [right=of B] {C; h=2}; % Node C with heuristic 2
        \node (D) [below=of B] {D; h=2}; % Node D with corrected heuristic 2
        \node (E) [below=of C] {E; h=1}; % Node E with heuristic 1
        \node (F) [below=of D, fill=black!80] {F; h=0}; % Goal node F highlighted with heuristic 0
        \node (G) [below=of E] {G; h=2}; % Node G with heuristic 2

        \draw (A) -- (B);
        \draw (A) -- (D);
        \draw (B) -- (C);
        \draw (B) -- (D);
        \draw (C) -- (E);
        \draw (D) -- (F);
        \draw (E) -- (G);

        % Cost labels with better visibility
        \node[draw, rectangle, fill=yellow!80, text=black, inner sep=1pt] at ($(A)!0.5!(B)$) [above] {1};
        \node[draw, rectangle, fill=yellow!80, text=black, inner sep=1pt] at ($(A)!0.5!(D)$) [left] {4};
        \node[draw, rectangle, fill=yellow!80, text=black, inner sep=1pt] at ($(B)!0.5!(C)$) [above] {2};
        \node[draw, rectangle, fill=yellow!80, text=black, inner sep=1pt] at ($(B)!0.5!(D)$) [right] {3};
        \node[draw, rectangle, fill=yellow!80, text=black, inner sep=1pt] at ($(C)!0.5!(E)$) [right] {1};
        \node[draw, rectangle, fill=yellow!80, text=black, inner sep=1pt] at ($(D)!0.5!(F)$) [left] {2};
        \node[draw, rectangle, fill=yellow!80, text=black, inner sep=1pt] at ($(E)!0.5!(G)$) [right] {1};

        % Highlight the explored edges
        \foreach \i/\j in {A/B, A/D, B/C, C/E, D/F} {
            \draw[thick, red] (\i) -- (\j);
        }

        % Indicate traversal order with black circles
        \node[draw, circle, fill=black!70, inner sep=1pt] at (A) [above right=0.2cm and 0.2cm of A] {\textcolor{white}{1}};
        \node[draw, circle, fill=black!70, inner sep=1pt] at (B) [above right=0.2cm and 0.2cm of B] {\textcolor{white}{2}};
        \node[draw, circle, fill=black!70, inner sep=1pt] at (D) [below left=0.2cm and 0.2cm of D] {\textcolor{white}{5}};
        \node[draw, circle, fill=black!70, inner sep=1pt] at (F) [below left=0.2cm and 0.2cm of F] {\textcolor{white}{6}};
        \node[draw, circle, fill=black!70, inner sep=1pt] at (C) [above right=0.2cm and 0.2cm of C] {\textcolor{white}{3}};
        \node[draw, circle, fill=black!70, inner sep=1pt] at (E) [below right=0.2cm and 0.2cm of E] {\textcolor{white}{4}};
\end{tikzpicture}
\end{center}
\subsection{Admissibility of A*}
\label{sec:orga86f64d}
A* always finds an optimal solution as the first path to the goal, if:
\begin{itemize}
\item the branching factor is finite
\item arc costs are bounded above 0
\item \(h(n)\) is a lower bound on the cost of the shortest path from \(n\) to a goal node
\end{itemize}

\textbf{Admissible} heuristics never overestimate the cost to the goal.

A* halts since the cost of the paths on the frontier keeps increasing and will eventually exceed
any finite number.

To construct an admissible heuristic:
\begin{enumerate}
\item define a relaxed problem by simplifying or removing constraints on the original problem
\item solve the relaxed problem without search
\item the cost of the optimal solution to the relaxed problem is an admissible heuristic for the the
original problem
\end{enumerate}

Preferred heuristics have higher values and are very different for different states (should help in
choosing which path to take).
\subsubsection{Dominating Heuristic}
\label{sec:org9d47c89}
Given heuristics \(h_{1}(n)\) and \(h_{2}(n)\), \(h_{2}(n)\) dominates \(h_{1}(n)\) if:
\begin{itemize}
\item \(\forall n \; h_{2}(n) \ge h_{1} (n)\)
\item \(\exists n \; h_{2}(n) > h_{1} (n)\)
\end{itemize}

If \(h_{2}(n)\) dominates \(h_{1}(n)\), A* using \(h_{2}\) will never expand more nodes than A* using
\(h_{1}(n)\).
\subsection{Properties of A* Search}
\label{sec:orgdf8161f}
Properties:
\begin{itemize}
\item \emph{space complexity}: exponential
\item \emph{time complexity}: exponential
\item \emph{completeness}: yes, with above assumptions
\item \emph{optimality}: yes, with above assumptions
\end{itemize}

A* is optimally efficient: no other algorithm with the same start node and same heuristic can find the
optimal path to the goal and expand fewer nodes.
This is because any algorithm that does not expand all nodes \(f(n) < \text{cost}(s,g)\) run the risk
of missing the optimal solution.
\subsection{Multi-Path Pruning and A*}
\label{sec:org4747b37}
With A*, it is possible that a subsequent path to some node is shorter than the first path to it.
To avoid this, ensure the heuristic is monotone.

A heuristic \(h\) is \textbf{monotone} is \(h(m) - h(n) \le \text{cost} (m, n)\) for every arc
\(\left< m, n \right>\).
This ensures the heuristic estimate of the path cost between any two adjacent nodes
is always less than the actual cost.

If \(h\) satisfies the monotone restriction, A* with multi-path pruning always finds the shortest path
to a goal.
