3B/CS486/04-Informed-Heuristic-Search.html
<div id="outline-container-org4294200" class="outline-2">
<h2 id="org4294200"><span class="section-number-2">3.</span> Adversarial Search</h2>
<div class="outline-text-2" id="text-3">
<p>
Find the best option for the player on the nodes they control (MAX nodes).
Assume competitor takes options worst for the player (MIN nodes).
Recursively search to leaf nodes to find state evaluations and percolate values upward through the
tree.
</p>

<p>
<b>Alpha-beta pruning</b>: method that allows ignoring portions of the search tree without losing optimality
(useful in practice but does not change worst-case)
</p>

<p>
Can stop search early at non-leaf nodes via heuristics, but optimality no longer guaranteed.
</p>
</div>
<div id="outline-container-org0f56682" class="outline-3">
<h3 id="org0f56682"><span class="section-number-3">3.1.</span> Bidirectional Search</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Searching is <b>symmetric</b>: it is the same to find path from start nodes to goal node or goal node
to start node.
</p>

<p>
<b>Forward branching factor</b>: number of arcs out of a node
</p>

<p>
<b>Backward branching factor</b>: number of arcs into a node
</p>

<p>
Search complexity is \(b^{n}\), so should use forward search if forward branching factor is less
than backward branching factor. (not possible if graph is dynamically constructed)
</p>

<p>
Can search simultaneously backwards from goal and forward from start, which can result exponential
saving in time/space.
</p>

<p>
In bidirectional search, frontiers must meet.
Often done with one breadth-first method that builds a set of locations to the goal and
the other direction using another method to find paths to these locations.
</p>
</div>
</div>
<div id="outline-container-org2fc0e5e" class="outline-3">
<h3 id="org2fc0e5e"><span class="section-number-3">3.2.</span> Island Driven Search</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Find a set of islands between the start and goal, which gives smaller problems to solve.
</p>

<p>
This reduces the time complexity to \(mb^{k/m}\) when \(m-1\) islands are used (\(m\) smaller problems to solve).
</p>

<p>
Difficult to guarantee optimality when identifying islands the path must pass through.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Arnav Gupta</p>
<p class="date">Created: 2024-10-18 Fri 00:37</p>
</div>
</body>
</html>
