3B/CS486/04-Informed-Heuristic-Search.tex
\section{Adversarial Search}
\label{sec:org3bb81a7}
Find the best option for the player on the nodes they control (MAX nodes).
Assume competitor takes options worst for the player (MIN nodes).
Recursively search to leaf nodes to find state evaluations and percolate values upward through the
tree.

\begin{algorithm}
\caption{Minimax Algorithm}
\begin{algorithmic}[1]
\Function{minimax}{node, depth, isMax}
    \If{depth = 0 or node is a terminal node}
        \State \Return the heuristic value of node
    \EndIf
    \If{isMax}
        \State bestValue $\gets -\infty$
        \For{each child of node}
            \State v $\gets$ \Call{minimax}{child, depth - 1, False}
            \State bestValue $\gets \max(\text{bestValue}, \text{v})$
        \EndFor
    \Else
        \State bestValue $\gets +\infty$
        \For{each child of node}
            \State v $\gets$ \Call{minimax}{child, depth - 1, True}
            \State bestValue $\gets \min(\text{bestValue}, \text{v})$
        \EndFor
    \EndIf
    \State \Return bestValue
\EndFunction
\end{algorithmic}
\end{algorithm}

\textbf{Alpha-beta pruning}: method that allows ignoring portions of the search tree without losing optimality
(useful in practice but does not change worst-case)

Can stop search early at non-leaf nodes via heuristics, but optimality no longer guaranteed.
\subsection{Bidirectional Search}
\label{sec:orgd8a8e10}
Searching is \textbf{symmetric}: it is the same to find path from start nodes to goal node or goal node
to start node.

\textbf{Forward branching factor}: number of arcs out of a node

\textbf{Backward branching factor}: number of arcs into a node

Search complexity is \(b^{n}\), so should use forward search if forward branching factor is less
than backward branching factor. (not possible if graph is dynamically constructed)

Can search simultaneously backwards from goal and forward from start, which can result exponential
saving in time/space.

In bidirectional search, frontiers must meet.
Often done with one breadth-first method that builds a set of locations to the goal and
the other direction using another method to find paths to these locations.
\subsection{Island Driven Search}
\label{sec:orgc0f5390}
Find a set of islands between the start and goal, which gives smaller problems to solve.

This reduces the time complexity to \(mb^{k/m}\) when \(m-1\) islands are used (\(m\) smaller problems to solve).

Difficult to guarantee optimality when identifying islands the path must pass through.
\end{document}
